ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_ans.c
/***************************************************************************//**
* \file cy_ble_ans.c
* \version 2.0
*
* \brief
*  Contains the source code for the Alert Notification Service.
*
********************************************************************************
* \copyright
* Copyright 2017, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/


#include "cy_ble_event_handler.h"

/* C binding of definitions if building with C++ compiler */
#ifdef __cplusplus
extern "C" {
#endif /* __cplusplus */

#if (CY_BLE_MODE_PROFILE && defined(CY_BLE_ANS))

static cy_ble_callback_t Cy_BLE_ANS_ApplCallback = NULL;

#ifdef CY_BLE_ANS_CLIENT
/* ANS Center Service characteristics GATT DB handles structure */
cy_stc_ble_ansc_t cy_ble_ansc[CY_BLE_CONFIG_GATTC_COUNT];

/* The internal storage for the last request handle to check response */
static cy_ble_gatt_db_attr_handle_t cy_ble_anscReqHandle[CY_BLE_CONFIG_GATTC_COUNT];
#endif /* (CY_BLE_ANS_CLIENT) */

/* The pointer to the global BLE ANS config structure */
cy_stc_ble_ans_config_t *cy_ble_ansConfigPtr = NULL;

/***************************************
* Private Function Prototypes
***************************************/
#ifdef CY_BLE_ANS_SERVER
static cy_en_ble_gatt_err_code_t Cy_BLE_ANSS_WriteEventHandler(cy_stc_ble_gatts_write_cmd_req_param_t *eventParam);
#endif /* CY_BLE_ANS_SERVER */

#ifdef CY_BLE_ANS_CLIENT
static void Cy_BLE_ANSC_DiscoverCharacteristicsEventHandler(cy_stc_ble_disc_char_info_t *discCharInfo);
static void Cy_BLE_ANSC_DiscoverCharDescriptorsEventHandler(cy_stc_ble_disc_descr_info_t *discDescrInfo);
static void Cy_BLE_ANSC_GetCharRange(cy_stc_ble_disc_range_info_t *charRangeInfo);
static void Cy_BLE_ANSC_NotificationEventHandler(cy_stc_ble_gattc_handle_value_ntf_param_t *eventParam);
static void Cy_BLE_ANSC_WriteResponseEventHandler(const cy_stc_ble_conn_handle_t *eventParam);
static void Cy_BLE_ANSC_ReadResponseEventHandler(cy_stc_ble_gattc_read_rsp_param_t *eventParam);
static void Cy_BLE_ANSC_ErrorResponseEventHandler(const cy_stc_ble_gatt_err_param_t *eventParam);
#endif /* (CY_BLE_ANS_CLIENT) */
static cy_en_ble_gatt_err_code_t Cy_BLE_ANS_EventHandler(uint32_t eventCode, void *eventParam);


/******************************************************************************
* Function Name: Cy_BLE_ANS_Init
***************************************************************************//**
*
*  This function initializes the Alert Notification Service.
*
*  \param config: The configuration structure for the Alert Notification Service.
*
*  \return
*  cy_en_ble_api_result_t : Return value indicates if the function succeeded or
*  failed. The following are possible error codes.
*
*   Error Codes                             | Description
*   ------------                            | -----------
*   CY_BLE_SUCCESS                          | The function completed successfully.
*   CY_BLE_ERROR_INVALID_PARAMETER          | On specifying NULL as input parameter
*   CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED   | Buffer overflow in the registration callback.
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_ANS_Init(cy_stc_ble_ans_config_t *config)
{
    cy_en_ble_api_result_t apiResult;

    if(config == NULL)
    {
        apiResult = CY_BLE_ERROR_INVALID_PARAMETER;
    }
    else
    {
        /* Registers a pointer to the config structure */
        cy_ble_ansConfigPtr = config;

        /* Registers Event Handler for the ANS Service */
        apiResult = Cy_BLE_RegisterServiceEventHandler(&Cy_BLE_ANS_EventHandler);

        /* Registers a callback function via the config structure */
        if(cy_ble_ansConfigPtr->callbackFunc != NULL)
        {
            Cy_BLE_ANS_ApplCallback = cy_ble_ansConfigPtr->callbackFunc;
        }

    #ifdef CY_BLE_ANS_CLIENT
        {
            uint32_t idx;
            for(idx = 0u; idx < CY_BLE_CONFIG_GATTC_COUNT; idx++)
            {
                if(cy_ble_serverInfo[idx][CY_BLE_SRVI_ANS].range.startHandle == CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE)
                {
                    (void)memset(&cy_ble_ansc[idx], 0, sizeof(cy_stc_ble_ansc_t));

                    /* initialize uuid  */
                    cy_ble_serverInfo[idx][CY_BLE_SRVI_ANS].uuid = CY_BLE_UUID_ALERT_NOTIFICATION_SERVICE;
                }
                cy_ble_anscReqHandle[idx] = CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE;
            }
        }
    #endif /* CY_BLE_ANS_CLIENT */
    }

    return(apiResult);
}


/******************************************************************************
* Function Name: Cy_BLE_ANS_RegisterAttrCallback
***************************************************************************//**
*
*  Registers a callback function for Alert Notification Service specific
*  attribute operations.
*  Service specific write requests from peer device will not be handled with
*  unregistered callback function.
*
*  \param callbackFunc: An application layer event callback function to receive
*                    service-specific events from the BLE Component. The
*                    definition of cy_ble_callback_t for Alert Notification
*                    Service is,\n
*                    typedef void (* cy_ble_callback_t)
*                        (uint32_t eventCode, void *eventParam)
*                    * eventCode indicates the event that triggered this
*                       callback (e.g. CY_BLE_EVT_ANSS_NOTIFICATION_ENABLED)
*                    * eventParam contains the parameters corresponding to
*                      the current event (e.g. Pointer to cy_stc_ble_ans_char_value_t
*                      structure that contains details of the  characteristic
*                      for which notification enabled event was triggered).
*
* \sideeffect
*  The *eventParams in the callback function should not be used by the
*  application once the callback function execution is finished. Otherwise
*  this data may become corrupted.
*
*  \return
*  cy_en_ble_api_result_t : Return value indicates if the function succeeded or
*  failed. The following are possible error codes:
*
*   Error Codes                             | Description
*   ------------                            | -----------
*   CY_BLE_SUCCESS                          | The function completed successfully.
*   CY_BLE_ERROR_INVALID_OPERATION          | This operation is not permitted
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_ANS_RegisterAttrCallback(cy_ble_callback_t callbackFunc)
{
    cy_en_ble_api_result_t apiResult = CY_BLE_SUCCESS;
    
    Cy_BLE_ANS_ApplCallback = callbackFunc;
    if(cy_ble_ansConfigPtr != NULL)
    {
        cy_ble_ansConfigPtr->callbackFunc = callbackFunc;
    }
    else
    {
        apiResult = CY_BLE_ERROR_INVALID_OPERATION;
    }
    
    return(apiResult);
}


#ifdef CY_BLE_ANS_SERVER

