ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_ans.c
/******************************************************************************
* Function Name: Cy_BLE_ANSS_WriteEventHandler
***************************************************************************//**
*
*  Handles Write Request Event for Alert Notification Service.
*
*  \param eventParam: The pointer to the data that came with a write request for
*                Alert Notification Service.
*
* \return
*  Return a value of type cy_en_ble_gatt_err_code_t:
*   * CY_BLE_GATT_ERR_NONE - The function terminated successfully.
*   * CY_BLE_GATT_ERR_INVALID_HANDLE - The handle of Client Configuration
*     Characteristic Descriptor or Characteristic of Alert Notification Service
*     is not valid.
*   * CY_BLE_GATT_ERR_UNLIKELY_ERROR - An Internal Stack error occurred.
*   * CY_BLE_GATT_ERR_REQUEST_NOT_SUPPORTED - The notification property of a
*     specific characteristic of Alert Notification Service is disabled.
*
******************************************************************************/
static cy_en_ble_gatt_err_code_t Cy_BLE_ANSS_WriteEventHandler(cy_stc_ble_gatts_write_cmd_req_param_t *eventParam)
{
    cy_stc_ble_ans_char_value_t wrReqParam;
    cy_ble_gatt_db_attr_handle_t tmpHandle;
    cy_en_ble_gatt_err_code_t gattErr = CY_BLE_GATT_ERR_NONE;
    uint32_t fFlag = 0u;
    uint32_t event = (uint32_t)CY_BLE_EVT_ANSS_WRITE_CHAR;

    tmpHandle = eventParam->handleValPair.attrHandle;

    /* Client Characteristic Configuration Descriptor Write Request */
    if((tmpHandle == cy_ble_ansConfigPtr->anss->charInfo[CY_BLE_ANS_NEW_ALERT].descrHandle[CY_BLE_ANS_CCCD]) ||
       (tmpHandle == cy_ble_ansConfigPtr->anss->charInfo[CY_BLE_ANS_UNREAD_ALERT_STATUS].descrHandle[CY_BLE_ANS_CCCD]))
    {
        /* Verify that optional notification property is enabled for Characteristic */
        if(CY_BLE_IS_NOTIFICATION_SUPPORTED(cy_ble_ansConfigPtr->anss->charInfo[CY_BLE_ANS_NEW_ALERT].charHandle) ||
           CY_BLE_IS_NOTIFICATION_SUPPORTED(cy_ble_ansConfigPtr->anss->charInfo[CY_BLE_ANS_UNREAD_ALERT_STATUS].charHandle))
        {
            if(CY_BLE_IS_NOTIFICATION_ENABLED_IN_PTR(eventParam->handleValPair.value.val))
            {
                event = (uint32_t)CY_BLE_EVT_ANSS_NOTIFICATION_ENABLED;
            }
            else
            {
                event = (uint32_t)CY_BLE_EVT_ANSS_NOTIFICATION_DISABLED;
            }

            if(tmpHandle == cy_ble_ansConfigPtr->anss->charInfo[CY_BLE_ANS_NEW_ALERT].descrHandle[CY_BLE_ANS_CCCD])
            {
                wrReqParam.charIndex = CY_BLE_ANS_NEW_ALERT;
            }
            else
            {
                wrReqParam.charIndex = CY_BLE_ANS_UNREAD_ALERT_STATUS;
            }

            /* Value is NULL for descriptors */
            wrReqParam.value = NULL;
        #if ((CY_BLE_GAP_ROLE_PERIPHERAL || CY_BLE_GAP_ROLE_CENTRAL) && (CY_BLE_BONDING_REQUIREMENT == CY_BLE_BONDING_YES))
            /* Set fFlag to store bonding data to flash */
            if(cy_ble_peerBonding[eventParam->connHandle.attId] == CY_BLE_GAP_BONDING)
            {
                cy_ble_pendingFlashWrite |= CY_BLE_PENDING_CCCD_FLASH_WRITE_BIT;
            }
        #endif /* (CY_BLE_BONDING_REQUIREMENT == CY_BLE_BONDING_YES) */
        }
        else
        {
            gattErr = CY_BLE_GATT_ERR_REQUEST_NOT_SUPPORTED;
        }
    }
    else if(tmpHandle == cy_ble_ansConfigPtr->anss->charInfo[CY_BLE_ANS_ALERT_NTF_CONTROL_POINT].charHandle)
    {
        /* Validate Command ID and Category ID ranges */
        if((eventParam->handleValPair.value.val[0u] <= CY_BLE_ANS_IMM_UNREAD_ALERT_STATUS_NTF) &&
           ((eventParam->handleValPair.value.val[1u] <= CY_BLE_ANS_CAT_ID_INSTANT_MESSAGE) ||
            (eventParam->handleValPair.value.val[1u] == CY_BLE_ANS_CAT_ID_ALL)))
        {
            wrReqParam.charIndex = CY_BLE_ANS_ALERT_NTF_CONTROL_POINT;
            wrReqParam.value = &eventParam->handleValPair.value;
        }
        else /* Command ID or Category ID received is invalid */
        {
            /* Erroneous request won't be notified to user but Error response will be sent. */
            cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;

            gattErr = CY_BLE_GATT_ERR_ANS_COMMAND_NOT_SUPPORTED;
        }
    }
    else
    {
        /* Requested handle does not belong to Alert Notification Service
         *  Characteristic or Descriptor. */
        fFlag = 1u;
    }

    if((gattErr == CY_BLE_GATT_ERR_NONE) && (fFlag == 0u))
    {
        /* Write value to GATT database */
        cy_stc_ble_gatts_db_attr_val_info_t dbAttrValInfo =
        {
            .handleValuePair = eventParam->handleValPair,
            .connHandle      = eventParam->connHandle,
            .offset          = 0u,
            .flags           = CY_BLE_GATT_DB_PEER_INITIATED
        };

        gattErr = Cy_BLE_GATTS_WriteAttributeValueCCCD(&dbAttrValInfo);

        if(gattErr == CY_BLE_GATT_ERR_NONE)
        {
            wrReqParam.connHandle = eventParam->connHandle;
            cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;

            if(Cy_BLE_ANS_ApplCallback != NULL)
            {
                Cy_BLE_ANS_ApplCallback(event, &wrReqParam);
            }
        }
    }

    if(CY_BLE_GATT_ERR_NONE != gattErr)
    {
        /* Indicate that request was handled */
        cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
    }

    return(gattErr);
}


/******************************************************************************
* Function Name: Cy_BLE_ANSS_SetCharacteristicValue
***************************************************************************//**
*
*  Sets a characteristic value of Alert Notification Service, which is a value
*  identified by charIndex, to the local database.
*
*  \param charIndex: The index of the service characteristic of type
*              cy_en_ble_ans_char_index_t. The valid values are,
*              * CY_BLE_ANS_SUPPORTED_NEW_ALERT_CAT
*              * CY_BLE_ANS_SUPPORTED_UNREAD_ALERT_CAT
*  \param attrSize: The size of the characteristic value attribute.
*  \param attrValue: The pointer to characteristic value data that should be stored
*               in the GATT database.
*
* \return
*  Return value is of type cy_en_ble_api_result_t.
*  * CY_BLE_SUCCESS - The request is handled successfully.
*  * CY_BLE_ERROR_INVALID_PARAMETER - Validation of the input parameters failed.
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_ANSS_SetCharacteristicValue(cy_en_ble_ans_char_index_t charIndex,
                                                          uint8_t attrSize,
                                                          uint8_t *attrValue)
{
    cy_en_ble_api_result_t apiResult = CY_BLE_ERROR_INVALID_PARAMETER;

    if(charIndex < CY_BLE_ANS_CHAR_COUNT)
    {
        cy_stc_ble_gatts_db_attr_val_info_t dbAttrValInfo =
        {
            .handleValuePair.attrHandle = cy_ble_ansConfigPtr->anss->charInfo[charIndex].charHandle,
            .handleValuePair.value.len  = attrSize,
            .handleValuePair.value.val  = attrValue,
            .offset                     = 0u,
            .flags                      = CY_BLE_GATT_DB_LOCALLY_INITIATED
        };

        /* Store data in database */
        if(Cy_BLE_GATTS_WriteAttributeValueCCCD(&dbAttrValInfo) == CY_BLE_GATT_ERR_NONE)
        {
            apiResult = CY_BLE_SUCCESS;
        }
    }

    return(apiResult);
}


