ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_ans.c
/******************************************************************************
* Function Name: Cy_BLE_ANSC_NotificationEventHandler
***************************************************************************//**
*
*  Handles Notification Event for Alert Notification Service.
*
*  \param cy_stc_ble_gattc_handle_value_ntf_param_t *eventParam: The pointer to a
*                                                     cy_stc_ble_gattc_handle_value_ntf_param_t
*                                                     data structure specified by
*                                                     the event.
*
******************************************************************************/
static void Cy_BLE_ANSC_NotificationEventHandler(cy_stc_ble_gattc_handle_value_ntf_param_t *eventParam)
{
    uint32_t discIdx = Cy_BLE_GetDiscoveryIdx(eventParam->connHandle);

    if((discIdx < CY_BLE_CONFIG_GATTC_COUNT) && (Cy_BLE_ANS_ApplCallback != NULL))
    {
        if((cy_ble_ansc[discIdx].characteristics[CY_BLE_ANS_NEW_ALERT].charInfo.valueHandle ==
            eventParam->handleValPair.attrHandle) ||
           (cy_ble_ansc[discIdx].characteristics[CY_BLE_ANS_UNREAD_ALERT_STATUS].charInfo.valueHandle ==
            eventParam->handleValPair.attrHandle))
        {
            cy_stc_ble_ans_char_value_t ntfParam =
            {
                .charIndex  = CY_BLE_ANS_NEW_ALERT,
                .connHandle = eventParam->connHandle,
                .value      = &eventParam->handleValPair.value
            };

            Cy_BLE_ANS_ApplCallback((uint32_t)CY_BLE_EVT_ANSC_NOTIFICATION, (void*)&ntfParam);
            cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
        }
    }
}


/******************************************************************************
* Function Name: Cy_BLE_ANSC_ReadResponseEventHandler
***************************************************************************//**
*
*  Handles Read Response Event for Alert Notification Service.
*
*  \param cy_stc_ble_gattc_read_rsp_param_t *eventParam: The pointer to the data that came
*                                            with a read response for ANS.
*
******************************************************************************/
static void Cy_BLE_ANSC_ReadResponseEventHandler(cy_stc_ble_gattc_read_rsp_param_t *eventParam)
{
    uint32_t fFlag = 1u;
    uint32_t attrVal = 0u;
    cy_en_ble_ans_char_index_t idx;
    uint32_t discIdx = Cy_BLE_GetDiscoveryIdx(eventParam->connHandle);

    if((discIdx < CY_BLE_CONFIG_GATTC_COUNT) && (Cy_BLE_ANS_ApplCallback != NULL) &&
       (cy_ble_anscReqHandle[discIdx] != CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE))
    {
        if(cy_ble_ansc[discIdx].characteristics[CY_BLE_ANS_SUPPORTED_NEW_ALERT_CAT].charInfo.valueHandle ==
           cy_ble_anscReqHandle[discIdx])
        {
            idx = CY_BLE_ANS_SUPPORTED_NEW_ALERT_CAT;
        }
        else if(cy_ble_ansc[discIdx].characteristics[CY_BLE_ANS_SUPPORTED_UNREAD_ALERT_CAT].charInfo.valueHandle ==
                cy_ble_anscReqHandle[discIdx])
        {
            idx = CY_BLE_ANS_SUPPORTED_UNREAD_ALERT_CAT;
        }
        else if(cy_ble_ansc[discIdx].characteristics[CY_BLE_ANS_NEW_ALERT].descriptors[CY_BLE_ANS_CCCD] ==
                cy_ble_anscReqHandle[discIdx])
        {
            /* Attribute is characteristic descriptor */
            attrVal = 1u;
            idx = CY_BLE_ANS_NEW_ALERT;
        }
        else if(cy_ble_ansc[discIdx].characteristics[CY_BLE_ANS_UNREAD_ALERT_STATUS].descriptors[CY_BLE_ANS_CCCD] ==
                cy_ble_anscReqHandle[discIdx])
        {
            /* Attribute is characteristic descriptor */
            attrVal = 1u;
            idx = CY_BLE_ANS_UNREAD_ALERT_STATUS;
        }
        else
        {
            /* No ANS characteristic was requested for read */
            fFlag = 0u;
        }

        if(fFlag != 0u)
        {
            /* Read response for characteristic */
            if(attrVal == 0u)
            {
                cy_stc_ble_ans_char_value_t rdRspParam =
                {
                    /* Fill Alert Notification Service read response parameter structure with characteristic info. */
                    .connHandle = eventParam->connHandle,
                    .charIndex  = idx,
                    .value      = &eventParam->value
                };
                rdRspParam.charIndex = idx;
                Cy_BLE_ANS_ApplCallback((uint32_t)CY_BLE_EVT_ANSC_READ_CHAR_RESPONSE, (void*)&rdRspParam);
            }
            else /* Read response for characteristic descriptor */
            {
                cy_stc_ble_ans_descr_value_t rdRspParam =
                {
                    /* Fill Alert Notification Service read response parameter structure with characteristic descriptor
                     * info. */
                    .connHandle = eventParam->connHandle,
                    .charIndex  = idx,
                    .descrIndex = CY_BLE_ANS_CCCD,
                    .value      = &eventParam->value
                };
                rdRspParam.charIndex = idx;
                Cy_BLE_ANS_ApplCallback((uint32_t)CY_BLE_EVT_ANSC_READ_DESCR_RESPONSE, (void*)&rdRspParam);
            }

            cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
            cy_ble_anscReqHandle[discIdx] = CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE;
        }
    }
}


/******************************************************************************
* Function Name: Cy_BLE_ANSC_WriteResponseEventHandler
***************************************************************************//**
*
*  Handles Write Response Event for Alert Notification Service.
*
*  \param cy_stc_ble_conn_handle_t *eventParam: The pointer to the cy_stc_ble_conn_handle_t data
*                                   structure.
*
******************************************************************************/
static void Cy_BLE_ANSC_WriteResponseEventHandler(const cy_stc_ble_conn_handle_t *eventParam)
{
    uint32_t fFlag = 1u;
    uint32_t attrVal = 0u;
    cy_en_ble_ans_char_index_t idx;
    uint32_t discIdx = Cy_BLE_GetDiscoveryIdx(*eventParam);

    if((discIdx < CY_BLE_CONFIG_GATTC_COUNT) && (Cy_BLE_ANS_ApplCallback != NULL) &&
       (cy_ble_anscReqHandle[discIdx] != CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE))
    {
        cy_stc_ble_ans_char_value_t wrRspParam = { .connHandle = *eventParam };

        if(cy_ble_ansc[discIdx].characteristics[CY_BLE_ANS_ALERT_NTF_CONTROL_POINT].charInfo.valueHandle ==
           cy_ble_anscReqHandle[discIdx])
        {
            idx = CY_BLE_ANS_ALERT_NTF_CONTROL_POINT;
        }
        else if(cy_ble_ansc[discIdx].characteristics[CY_BLE_ANS_NEW_ALERT].descriptors[CY_BLE_ANS_CCCD] ==
                cy_ble_anscReqHandle[discIdx])
        {
            /* Attribute is Characteristic Descriptor */
            attrVal = 1u;
            idx = CY_BLE_ANS_NEW_ALERT;
        }
        else if(cy_ble_ansc[discIdx].characteristics[CY_BLE_ANS_UNREAD_ALERT_STATUS].descriptors[CY_BLE_ANS_CCCD] ==
                cy_ble_anscReqHandle[discIdx])
        {
            /* Attribute is Characteristic Descriptor */
            attrVal = 1u;
            idx = CY_BLE_ANS_UNREAD_ALERT_STATUS;
        }
        else
        {
            /* No ANS characteristic was requested for write */
            fFlag = 0u;
        }

        if(fFlag != 0u)
        {
            /* Write response for characteristic */
            if(attrVal == 0u)
            {
                wrRspParam.charIndex = idx;
                wrRspParam.value = NULL;

                Cy_BLE_ANS_ApplCallback((uint32_t)CY_BLE_EVT_ANSC_WRITE_CHAR_RESPONSE, (void*)&wrRspParam);
            }
            else /* Write response for characteristic descriptor */
            {
                /* Fill Alert Notification Service write response parameter structure with
                 * characteristic descriptor info. */
                cy_stc_ble_ans_descr_value_t wrDescRspParam =
                {
                    .connHandle = *eventParam,
                    .charIndex  = idx,
                    .descrIndex = CY_BLE_ANS_CCCD,
                    .value      = NULL
                };

                Cy_BLE_ANS_ApplCallback((uint32_t)CY_BLE_EVT_ANSC_WRITE_DESCR_RESPONSE, (void*)&wrDescRspParam);
            }

            cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
            cy_ble_anscReqHandle[discIdx] = CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE;
        }
    }
}


